{
  "version": "2.3.0",
  "download_url": "https://github.com/zdravkopavlov/Currency-Coverter/releases/download/v2.3.0/BGN-EUR_Converter_Setup_2.3.0.exe",
  "changelog": "- Преизградена архитектура: кодът е разделен на отделни файлове\n- Добавен модъл за изчисляване на ресто, във валута еввро, при плащане в лева.\n- Компактен режим показва само релевантните елементи за всяка страница, със запазени цветове и центриране\n- “Ресто” и сума се показват коректно и винаги следват темата, включително и дадената сума в компактен режим\n- Копирането в клипборда вече е оптимизирано: работи само при промяна на стойност, елиминирайки грешките с OleSetClipboard и забавянията\n- SPACE вече сменя посоката само на страницата за конвертиране, TAB сменя страниците — точно както искат касиерите\n- Оправен е визуален бъг с изрязване на сумата за ресто в компактен режим\n- Логиката за изчисления е bulletproof — гарантирано точни резултати във всички сценарии\n\n## 2.2.7 (2025-07-11)\n- Пренаредени и опростени настройки и update блок за по-логичен и чист изглед\n- Тема: Падащото меню вече е на един ред с надписа и с фиксирана ширина\n- Всички бутони и етикети вече имат правилен падинг и изглеждат модерно във всички теми\n- Update секцията вече е визуално групирана със светъл фон и балансирано разстояние\n- Лейбълът за версията вече не се появява в компактен/минимален режим (никога повече \"зомби\" етикет!)\n- Оправен е проблемът с ръчната проверка за обновления — показва се вярна информация и бутон за изтегляне, когато има нова версия\n- UI логиката за показване/скриване етикети и бутони е \"bulletproof\" — елиминирани са всички случайни \"подскачания\" и грешки при превключване между режими\n- Малки оптимизации и вътрешни корекции за още по-надеждна работа\n\n## 2.2.6 (2025-07-11)\n- Тестов рилийз за тестване не ъпдейт функцията\n\n## 2.2.5 (2025-07-11)\n- Ъпдейт известието вече използва неутрален сив цвят, без подчертаване, видим на всички теми\n- Всички бутони, падащи менюта и статус съобщения следват избраната тема (светла/тъмна) изцяло\n- Поправен е бъг, при който съобщението за нова версия винаги беше синьо и подчертано, независимо от темата\n- Поправен срив при ръчна проверка за обновления, когато автоматичната проверка е изключена\n- Още по-чист и стабилен интерфейс: визуалните съобщения и бутони се обновяват коректно при смяна на темата или след проверка за обновления\n- Малки вътрешни подобрения и рефакторинг на кода\n\n## 2.2.4 (2025-07-11)\n- Streamlined the update process with a new downloader script\n- Fixed issues with orphaned settings dialog\n- Improved single instance logic to prevent multiple app launches\n- Enhanced UI responsiveness and stability\n\n## 2.2.3 (2025-07-10)\n- Fixed crash when closing orphaned settings dialog\n\n## 2.2.2 (2025-07-10)\n- Ново: Истинска “единична инстанция” — не може да се стартират няколко копия на приложението, дори ако то е минимизирано в трея.\n- Подобрено: Ако приложението вече работи, всяко ново стартиране (чрез икона, старт меню или EXE) автоматично показва съществуващия прозорец и го поставя най-отгоре (дори ако е било скрито/в трея).\n- Поправено: Премахнати предупреждения за cursor: от стилизирането на бутоните.\n- Подобрено: Логиката за блокиране на повече от една инстанция работи стабилно и след пакетиране като EXE.\n\n## 2.2.1 (2025-07-10)\n- Официален релийз с основните функции: конвертиране BGN/EUR, автоматично копиране на резултата, запомняне на позиция, минимален и класически режим, трей икона, настройки.\n- Добавена функционалност за Проверка за нови версии\n\n## 2.1.0 (2024-07-10)\n- Добавен десен бутон за достъп до настройки и помощен прозорец (popup)\n- Пълна поддръжка на тъмна и светла тема с live превключване\n- Подобрено потребителско изживяване: автоматично затваряне на popup, скриване на X бутона\n- Прозорецът с документация се позиционира спрямо основния прозорец\n- Включена автоматична документация и помощни файлове\n- Актуализирани иконки, надписи и tray менюто\n- Коригирано копиране на резултат, автосъхранение на настройки\n\n## 2.0.2 (2024-07-07)\n- Официален релийз на основните функции: конвертиране, auto copy, позиция, трей, настройки\n\n## 2.0.1 (2024-07-06)\n- Добавени настройки за позиция на прозореца, auto copy и трей икона\n\n## 2.0.0 (2024-07-05)\n- Интерфейсът е изцяло преработен с OyQt5\n- добавен е инсталационен файл за Windows\n\n## 1.0.0 (2024-07-04)\n- Първоначален релийз с основни функции за конвертиране",
  "date": "2025-07-13"
}